benchmark/logs/parallels/200Parallels/ApacheBench.txt
root@ubuntu:~# ab -n 5000 -c 200 benchmark-machinegun-service.default.svc.cluster.local:8080/send?destination="http://target/myPath"
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking benchmark-machinegun-service.default.svc.cluster.local (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:
Server Hostname:        benchmark-machinegun-service.default.svc.cluster.local
Server Port:            8080

Document Path:          /send?destination=http://target/myPath
Document Length:        39 bytes

Concurrency Level:      200
Time taken for tests:   11.198 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      1195000 bytes
HTML transferred:       195000 bytes
Requests per second:    446.51 [#/sec] (mean)
Time per request:       447.918 [ms] (mean)
Time per request:       2.240 [ms] (mean, across all concurrent requests)
Transfer rate:          104.21 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   2.9      1      15
Processing:    20  439  87.0    433     747
Waiting:        5  379  79.0    374     623
Total:         21  441  86.4    434     752

Percentage of the requests served within a certain time (ms)
  50%    434
  66%    467
  75%    494
  80%    507
  90%    541
  95%    598
  98%    635
  99%    741
 100%    752 (longest request)